docs/arkitektur/tilstander/NAVe 04-01.03.approved.md
```mermaid
   stateDiagram
   [*]-->MottattType
   	MottattType --> AvventerJournalpostType
	AvventerJournalpostType --> AvventerPersondataType
	AvventerPersondataType --> KategoriseringType
	KategoriseringType --> AvventerSøknadsdataType
	AvventerSøknadsdataType --> HåndterHenvendelseType
    HåndterHenvendelseType --> AventerArenaOppgaveType
    HåndterHenvendelseType --> AvventerFerdigstillJournalpostType
	AventerArenaOppgaveType --> AvventerFerdigstillJournalpostType
	AvventerFerdigstillJournalpostType --> InnsendingFerdigstiltType
   InnsendingFerdigstiltType--> [*]    
```
